--drop table team18.every_page_parsed;
create table team18.every_page_parsed as 
with a as (
SELECT "Холодильник", "Посудомоечная машина", "Стиральная машина", "Кондиционер", "Телевизор", "Интернет", "Мебель на кухне", "Мебель в комнатах", "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", link
FROM team18.sergey_2369
union all
SELECT "Холодильник", "Посудомоечная машина", "Стиральная машина", "Кондиционер", "Телевизор", "Интернет", "Мебель на кухне", "Мебель в комнатах", "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки", "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", link
FROM team18.olga_6430_9645
union all
SELECT "Холодильник", "Посудомоечная машина", "Стиральная машина", "Кондиционер", "Телевизор", "Интернет", "Мебель на кухне", "Мебель в комнатах", "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", link
FROM team18.kirill
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", url as link
FROM team18."12860_16075_polyna.csv"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1000_1100"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1100_1200"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1200_1300"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1300_1400"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1320_1400"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1400_1500"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1500_1600"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1600_1700"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1700_1800"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1800_1900"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_1900_2000"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_2000_2100"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_2100_2400"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", link
from team18."2400_2800_ivan"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_500"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_500_600"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_600_700"
union all
SELECT "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность", "index" as link
from team18."Ivan_700_1000"
union all
select "Холодильник"::bigint, "Посудомоечная машина"::bigint, "Стиральная машина"::bigint, "Кондиционер"::bigint, "Телевизор"::bigint, "Интернет"::bigint, "Мебель на кухне"::bigint, "Мебель в комнатах"::bigint, "Оплата ЖКХ", "Залог", "Комиссии", "Предоплата", "Срок аренды", "Условия проживания", "Общая площадь", "Жилая площадь", "Площадь кухни", "Санузел", "Балкон/лоджия", "Вид из окон", "Ремонт", "Год постройки"::float, "Количество лифтов", "Тип перекрытий", "Парковка", "Отопление", "Аварийность",  link
 from team18."2800_3215_ivan_2.csv")
,cte as (
select *,row_number() over(partition by link) rn from a
where 
"Аварийность" is not null
or "Год постройки" is not null
or "Количество лифтов" is not null 
or "Тип перекрытий" is not null 
or "Парковка" is not null
or "Ремонт" is not null)
--
select
	"Холодильник",
	"Посудомоечная машина",
	"Стиральная машина",
	"Кондиционер",
	"Телевизор",
	"Интернет",
	"Мебель на кухне",
	"Мебель в комнатах",
	case when "Оплата ЖКХ" like '%без счётчиков%' then 'счетчики отдельно'
	when "Оплата ЖКХ" like '%включены%' then 'включены в сумму'
	else 'nd' end "Оплата ЖКХ",
	case when replace(replace("Залог",' ',''),'₽','') like '%нет%' then 0 else replace(replace(replace("Залог",' ',''),'₽',''),' ','')::int end  "Залог",
	--"Комиссии",
	case when "Предоплата" = '1 месяц' then 1 
		 when "Предоплата" = '2 месяца' then 2 
		 when "Предоплата" = '3 месяца' then 3
		 when "Предоплата" = '4 месяца' then 4
		 else 0 end "Предоплата_месяцев",
	case when "Срок аренды" like '%год%' then 'от года' when "Срок аренды" like '%месяц%' then 'несколько месяцев' else 'nd' end "Срок аренды",
	lower(replace("Условия проживания",'Условия проживания','')) like '%животн%' "С животными",
	lower(replace("Условия проживания",'Условия проживания','')) like '%дет%' "С детьми",
	replace(SPLIT_PART("Общая площадь",' ',1),',','.')::float "Общая площадь",
	replace(SPLIT_PART("Жилая площадь",' ',1),',','.')::float "Жилая площадь",
	replace(SPLIT_PART("Площадь кухни",' ',1),',','.')::float "Площадь кухни",
	"Санузел",
	"Балкон/лоджия",
	replace("Вид из окон",'Вид из окон','') "Вид из окон",
	replace("Ремонт",'Ремонт','') "Ремонт",
	"Год постройки",
	"Количество лифтов",
	replace("Тип перекрытий" ,'Тип перекрытий','') "Тип перекрытий",
	"Парковка",
	replace("Отопление",'Отопление','') "Отопление",
	case when lower("Аварийность") like '%да%' then 1 
when lower("Аварийность") like '%нет%' then 0 end "Аварийность",
	link
from
	cte
where
	rn = 1